# n = int(input("Введите кол-во км пройденное за день: "))
# m = int(input("Введите длину маршрута: "))
# print((m + n - 1) // n)


# a = int(input("Введите кол-во учеников в 1-ом кабинете: "))
# b = int(input("Введите кол-во учеников в 2-ом кабинете: "))
# c = int(input("Введите кол-во учеников в 3-ом кабинете: "))
# result = a // 2 + a % 2 + b // 2 + b % 2 + c // 2 + c % 2
# print(result)

# i = int(input("Введите номер вагона от головы"))
# j = int(input("Введите реальный номер вагона"))
# l = int(input("Введите 1, если нумерация с головы или 0, если нумерация с хвоста поезда"))
# if l == 1:
#     print("Невозможно определить длину поезда")
# else:
#     k = j+i-1
#     print(k)

# n = int(input("Введите год: "))
# if (n % 4 == 0 and n % 100 != 0) or n % 400 == 0:
#     print("YES")
# else:
#     print("NO")

